tutorials/Rbn_tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-22 Wed 16:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coupled-cluster theory calculations of rhombohedral boron nitride</title>
<meta name="generator" content="Org mode" />

    <meta charset='UTF-8'>
    <meta name='apple-mobile-web-app-capable' content='yes'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <link
      href='https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css'
      rel='stylesheet'
      integrity='sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU'
      crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">

  <nav class='navbar navbar-expand-lg navbar-light bg-light'>
    <div class='container-fluid'>
      <a class='navbar-brand' href='#'>
        Cc4s
      </a>
      <button class='navbar-toggler' type='button'
              data-bs-toggle='collapse'
              data-bs-target='#navbarSupportedContent'
              aria-controls='navbarSupportedContent'
              aria-expanded='false'
              aria-label='Toggle navigation'>
        <span class='navbar-toggler-icon'></span>
      </button>
      <div class='collapse navbar-collapse' id='navbarSupportedContent'>
        <ul class='navbar-nav me-auto mb-2 mb-lg-0'>
          <li class='nav-item'>
            <a class='nav-link' aria-current='page' href='/user-manual/index.html'>
              <i class='fa fa-home'></i>
              Home
            </a>
          </li>
          <li class='nav-item'>
            <a class='nav-link' href='/user-manual/sitemap.html'>
              <i class='fa fa-sign-out'></i>
              Sitemap
            </a>
          </li>
        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">Coupled-cluster theory calculations of rhombohedral boron nitride</h1>

<div id="outline-container-org985fddd" class="outline-2">
<h2 id="org985fddd"><span class="section-number-2">1</span> <a href="#org985fddd">Introduction</a></h2>
<div class="outline-text-2" id="text-1">
<p>
In this tutorial we explain all steps necessary to perform a  <code>Cc4s</code> calculation
on the level of CCSD(T) theory for a simple test system.
</p>
</div>
</div>

<div id="outline-container-orga711914" class="outline-2">
<h2 id="orga711914"><span class="section-number-2">2</span> <a href="#orga711914">Prerequisites</a></h2>
<div class="outline-text-2" id="text-2">
<p>
The following files are needed to reproduce all calculations of this tutorial.
</p>

<ul class="org-ul">
<li>A working binary of <code>./Cc4s</code>   ( TODO add link to getting started section )</li>
<li>A set of input files generated by the <code>VASP</code> interface ( TODO add link to test-resources )
<ul class="org-ul">
<li>\(\Gamma^{pG}_{q}\) :  <code>CoulombVertex.yaml</code>, <code>CoulombVertex.dat</code></li>
<li>\(\epsilon_{p}\) : <code>EigenEnergies.yaml</code>, <code>EigenEnergies.dat</code></li>
<li>\(\vec G\) : <code>GridVectors.yaml</code>, <code>GridVectors.dat</code></li>
<li>\(\tilde{v}(\vec G)\) : <code>CoulombPotential.yaml</code>, <code>CoulombPotential.dat</code></li>
<li>\(\delta^{ab}_{ij}\) : <code>DeltaPPHH.yaml</code>, <code>DeltaPPHH.dat</code></li>
<li>\(\delta_{ij}\) : <code>DeltaHH.yaml</code>, <code>DeltaHH.dat</code></li>
<li>\(U_F^G\) : <code>CoulombVertexSingularVectors.yaml</code>, <code>CoulombVertexSingularVectors.dat</code></li>
<li>\(\epsilon_{ij}\) : <code>Mp2PairEnergies.yaml</code>, <code>Mp2PairEnergies.dat</code></li>
</ul></li>
</ul>

<p>
For the following example we assume that all above input files and <code>cc4s.in</code> are located in the same directory where
the <code>Cc4s</code> binary is called. The <code>cc4s.in</code> YAML input file is described in the following section.
</p>
</div>
</div>

<div id="outline-container-orgd371f2a" class="outline-2">
<h2 id="orgd371f2a"><span class="section-number-2">3</span> <a href="#orgd371f2a">Description of CCSD calculations</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>Cc4s</code> calculations are controlled by a YAML input file. Every input file consists of a list
of calls to algorithms with input arguments and output objects.
The output of any algorithm becomes available as potential input for all subsequent algorithm calls.
</p>

<p>
For the present tutorial we seek to compute the electronic correlation energy on the level of
CCSD(T) theory.
To this end <code>Cc4s</code> has to read in essential data files from disk, which can be achieved using the
<code>TensorReader</code> algorithm.
Here, we employ <code>./cc4s.in</code> as the YAML input file that controls <code>Cc4s</code> and we edit this file to contain the following code block
</p>

<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #8b4513;">name</span>: TensorReader
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">fileName</span>: <span style="color: #50a14f;">"CoulombVertex.yaml"</span>
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">tensor</span>: CoulombVertex
</pre>
</div>

<p>
The above call to the <code>TensorReader</code> algorithm reads in the
<b>CoulombVertex.yaml</b> file that contains all meta-information of the
<a href="../objects/CoulombVertex.html#ID-CoulombVertex"><code>CoulombVertex</code></a> tensor in a human-readable format.
If <code>Cc4s</code> is not in the dry-run mode (TODO: add link to dry-run description), it will also follow the link in
<b>CoulombVertex.yaml</b> to <b>CoulombVertex.dat</b> and read in all numerical data of
the corresponding <a href="../objects/CoulombVertex.html#ID-CoulombVertex"><code>CoulombVertex</code></a> tensor.
The output of <code>TensorReader</code> algorithm is the <a href="../objects/CoulombVertex.html#ID-CoulombVertex"><code>CoulombVertex</code></a> tensor object, which can
be used as input for all subsequent
<code>Cc4s</code> algorithms if needed.
</p>

<p>
In addition, we want <code>Cc4s</code> to read in the <b>EigenEnergies.yaml</b> and
<b>EigenEnergies.dat</b> files by including the following <code>TensorReader</code> call in the
<code>./cc4s.in</code> file
</p>
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #8b4513;">name</span>: TensorReader
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">fileName</span>: <span style="color: #50a14f;">"EigenEnergies.yaml"</span>
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">tensor</span>: EigenEnergies
</pre>
</div>

<p>
In the following step we include two further algorithm calls that are necessary
to process the <a href="../objects/CoulombVertex.html#ID-CoulombVertex"><code>CoulombVertex</code></a> and <code>EigenEnergies</code>
tensors in <code>Cc4s</code> and prepare them for coupled-cluster calculations. To this end the <code>./cc4s.in</code> file calls the
<a href="../algorithms/DefineHolesAndParticles.html#ID-DefineHolesAndParticles">DefineHolesAndParticles</a> and
<a href="../algorithms/SliceOperator.html#ID-SliceOperator">SliceOperator</a> algorthims as described below
</p>

<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #8b4513;">name</span>: DefineHolesAndParticles
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">eigenEnergies</span>: EigenEnergies
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">slicedEigenEnergies</span>: EigenEnergies

- <span style="color: #8b4513;">name</span>: SliceOperator
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">slicedEigenEnergies</span>: EigenEnergies
    <span style="color: #8b4513;">operator</span>: CoulombVertex
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">slicedOperator</span>: CoulombVertex
</pre>
</div>

<p>
Note that we have now overwritten the original tensors stored in
<a href="../objects/CoulombVertex.html#ID-CoulombVertex"><code>CoulombVertex</code></a> and <code>EigenEnergies</code>,
turning them into objects of the type <code>slicedOperator</code> and <code>slicedEigenEnergies</code>, respectively.
Using these outputs, we can call the <a href="../algorithms/VertexCoulombIntegrals.html#ID-VertexCoulombIntegrals">VertexCoulombIntegrals</a>
 algorithm of <code>Cc4s</code> by including
the follow paragraph in the  <code>./cc4s.in</code> file
</p>
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #8b4513;">name</span>: VertexCoulombIntegrals
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">slicedCoulombVertex</span>: CoulombVertex
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">coulombIntegrals</span>: CoulombIntegrals
</pre>
</div>

<p>
The <code>VertexCoulombIntegrals</code> algorithm produces the <code>CoulombIntegrals</code> output, which serves as input to the
<code>CoupledCluster</code> algorithm and is called using the following code block in  <code>./cc4s.in</code>
</p>

<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #8b4513;">name</span>: CoupledCluster
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">method</span>:
      <span style="color: #8b4513;">type</span>: Ccsd
      <span style="color: #8b4513;">integralsSliceSize</span>: 100
    <span style="color: #8b4513;">slicedEigenEnergies</span>: EigenEnergies
    <span style="color: #8b4513;">coulombIntegrals</span>: CoulombIntegrals
    <span style="color: #8b4513;">slicedCoulombVertex</span>: CoulombVertex
    <span style="color: #8b4513;">maxIterations</span>: 30
    <span style="color: #8b4513;">energyConvergence</span>: 1.0E-5
    <span style="color: #8b4513;">amplitudesConvergence</span>: 1.0E-5
    <span style="color: #8b4513;">mixer</span>:
      <span style="color: #8b4513;">type</span>: DiisMixer
      <span style="color: #8b4513;">maxResidua</span>: 5
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">energy</span>: CcsdEnergy
    <span style="color: #8b4513;">amplitudes</span>: Amplitudes
</pre>
</div>

<p>
If all code blocks given above are included in the <code>./cc4s.in</code> file and all other prerequisites all fulfilled,
<code>Cc4s</code> can be called by typing the following in the terminal:
</p>
<div class="org-src-container">
<pre class="src src-sh">Cc4s -i cc4s.in
</pre>
</div>

<p>
If all algorithms work successfully, the following output stream will appear on the terminal
</p>
<div class="org-src-container">
<pre class="src src-sh">
                __ __      
     __________/ // / _____
    / ___/ ___/ // /_/ ___/
   / /__/ /__/__  __(__  ) 
   <span style="color: #50a14f;">\_</span>__/<span style="color: #50a14f;">\_</span>__/  /_/ /____/  
  Coupled Cluster for Solids

version: heads/develop-0-g3c7f382, date: Fri Dec 17 16:11:36 2021 +0100
build date: Dec 21 2021 18:00:10
compiler: icc (ICC) 19.1.0.166 20191121
total processes: 1
calculation started on: Tue Dec 21 22:35:27 2021


execution plan read, steps: 6

step: 1, TensorReader
Reading from binary file CoulombVertex.dat
realtime 2.327871286 s
--
step: 2, TensorReader
Reading from text file EigenEnergies.dat
realtime 0.006519348 s
--
step: 3, DefineHolesAndParticles
number of holes     No: 16
number of particles Nv: 80
number of states    Np: 96
realtime 0.001037427 s
--
step: 4, SliceOperator
Slicing CoulombVertex.dat into holes and particles.
realtime 0.000913122 s
--
step: 5, VertexCoulombIntegrals
number of field variables NF: 356
realtime 0.015747318 s
--
step: 6, CoupledCluster
Using method Ccsd. integralsSliceSize: 100
Using mixer DiisMixer. maxResidua: 5
Maximum number of iterations: 30
Unless reaching energy convergence dE: 1e-05
and amplitudes convergence dR: 1e-05
Iter         Energy         dE           dR         time   GF/s/core
   1  -2.43605043e+01  -2.4361e+01   4.3924e-01      4.1    5.7
   2  -2.47577534e+01  -3.9725e-01   7.4733e-02     30.8    6.1
   3  -2.53776918e+01  -6.1994e-01   1.8674e-02     24.9    7.5
   4  -2.54455925e+01  -6.7901e-02   6.4132e-03     25.3    7.3
   5  -2.54445080e+01   1.0845e-03   2.2120e-03     25.8    7.2
   6  -2.54458312e+01  -1.3232e-03   1.0304e-03     25.7    7.2
   7  -2.54448941e+01   9.3705e-04   5.0727e-04     25.8    7.2
   8  -2.54452894e+01  -3.9521e-04   1.9694e-04     25.8    7.2
   9  -2.54454262e+01  -1.3682e-04   7.7180e-05     25.8    7.2
  10  -2.54455328e+01  -1.0663e-04   3.0247e-05     25.8    7.2
  11  -2.54455929e+01  -6.0110e-05   1.1758e-05     25.7    7.2
  12  -2.54456151e+01  -2.2218e-05   5.0053e-06     25.7    7.2
  13  -2.54456249e+01  -9.7454e-06   2.2689e-06     25.7    7.2

CCSD correlation energy:          -25.4456248862
2nd-order correlation energy:     -24.3605043096
realtime 317.059767911 s
--
total realtime: 319.445774591 s
total operations: 2267.4 GFLOPS, speed: 7.1 GFLOPS/s/core
</pre>
</div>
</div>
</div>

<div id="outline-container-org23fdd78" class="outline-2">
<h2 id="org23fdd78"><span class="section-number-2">4</span> <a href="#org23fdd78">Description of finite-size correction to CCSD</a></h2>
</div>

<div id="outline-container-org2f405c6" class="outline-2">
<h2 id="org2f405c6"><span class="section-number-2">5</span> <a href="#org2f405c6">Description of basis-set incompleteness errors corrections to CCSD</a></h2>
</div>

<div id="outline-container-orgb965848" class="outline-2">
<h2 id="orgb965848"><span class="section-number-2">6</span> <a href="#orgb965848">Description of CCSD(T) calculations</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-12-22 Wed 16:42</p>
</div>
</body>
</html>
